{
  "events": [
    {
      "title": "RTV CRON 0x1",
      "dateRange": "March 27, 2025",
      "times": "7:00PM EDT",
      "location": "RTV Youtube Channel",
      "description": "We're thrilled to launch RTV CRON, our new recurring series where cybersecurity meets community! We'll have a live workshop and we'll also be discussing the latest news in the village.\n\nThis month, we'll be joined by Jeff Tomkiewicz to discuss the art of Pretexting. Pretexting is one of the most powerful and versatile tools in the social engineer’s arsenal. Whether used in red teaming, penetration testing, or adversary simulation, a well-crafted pretext can bypass even the most hardened security controls—not through technical exploits, but by leveraging trust, authority, and human psychology.\n\nIn this two-hour interactive workshop, we will dive deep into the art and science of pretexting, exploring its historical roots, ethical considerations, and real-world applications in offensive security. Participants will gain hands-on experience in developing layered personas, crafting believable scenarios, and executing pretexts across multiple attack surfaces, including phishing campaigns, vishing (voice phishing), and physical infiltration techniques.",
      "image": {
        "src": "rtv-cron-0x1.jpg",
        "alt": "RTV cron"
      },
      "link": {
        "url": "https://www.youtube.com/watch?v=vlow4qZSOSE",
        "text": "RTV Youtube Channel",
        "external": true
      },
      "tags": ["Workshop", "Live"]
    },
    {
      "title": "RTV CRON Episode 2",
      "dateRange": "April 24, 2025",
      "times": "TBD",
      "location": "RTV Youtube Channel",
      "description": "RTV cron Episode 2 will be a live workshop (speaker TBD) and we'll also be discussing the latest news in the village.",
      "image": {
        "src": "RTVcron.png",
        "alt": "RTV cron"
      },
      "link": {
        "url": "https://www.youtube.com/redteamvillage",
        "text": "RTV Youtube Channel",
        "external": true
      },
      "tags": ["Workshop", "Live"]
    },
    {
      "title": "RTV @ HackSpaceCon",
      "dateRange": "May 14-15, 2025",
      "times": "TBD",
      "location": "Radisson Resort at the Port",
      "description": "RTV will be at HackSpaceCon 2025. We'll have a booth and we'll be discussing the latest news in the village. We'll also be hosting a CTF competition.",
      "image": {
        "src": "rtv-hsc-2025.png",
        "alt": "RTV at HackSpaceCon 2025"
      },"link": {
        "url": "https://www.hackspacecon.com/",
        "text": "HackSpaceCon Website",
        "external": true
      },
      "tags": ["Virtual", "Meetup", "Supply Chain"]
    },
    {
      "title": "Red Team Village at DEF CON 33",
      "dateRange": "August 7-10, 2025",
      "times": "TBD",
      "location": "Las Vegas Convention Center, Red Team Village Area",
      "description": "Visit the village at DEF CON 33! We'll have a weekend packed with workshops, activities, swag, and so much more!",
      "image": {
        "src": "dc33.png",
        "alt": "DEF CON 33"
      },
      "link": {
        "url": "https://www.defcon.org/",
        "text": "DEF CON Website",
        "external": true
      },
      "tags": ["Conference", "DEF CON"]
    }
  ]
} 