{
  "events": [
    {
      "name": "DEF CON 33 (2025)",
      "dates": "August 7-10, 2025",
      "location": "Las Vegas, Nevada",
      "description": "Join us at the world's largest hacker convention where Red Team Village will host workshops, capture the flag competitions, more!",
      "image": "dc33.png",
      "levels": [
        {
          "name": "Diamond",
          "sponsors": [
          ]
        },
        {
          "name": "Platinum",
          "sponsors": [
            {
              "name": "Flare",
              "description": "Flare is the leader in Threat Exposure Management, helping organizations of all sizes detect high-risk exposures found on the clear and dark web. Combining the industry's best cybercrime database with a ridiculously intuitive user experience, Flare enables customers to reclaim the information advantage and get ahead of threat actors. For more information, visit https://flare.io",
              "website": "https://flare.io/",
              "logo": "flare.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/flaresystems"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/flare-io"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@flarecybersecurity"
                }
              ]
            },
            {
              "name": "White Knight Labs",
              "description":"A Global Cyber Security Consultancy specializing in Offensive Cyber Engagements.",
              "website": "https://whiteknightlabs.com/",
              "logo": "wkl-3.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://twitter.com/WKL_cyber"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/white-knight-labs/"
                }
              ]
            },
            {
              "name": "Amazon",
              "description": "The Devices and Services Security team builds innovative tools that detect, assess, and mitigate security issues across our consumer device businesses, from Echo to Fire TV to Alexa. We believe the best way to protect our customers is to ensure our products are secure and compliant by default, and our security engineers and developers are working together across the product development life cycle to make that a reality.",
              "website": "https://amazon.jobs/content/en/teams/amazon-security/devices-services",
              "logo": "amazon.png"
            },
            {
              "name": "Kindo",
              "description": "Kindo revolutionizes enterprise operations by integrating autonomous infrastructure with AI-native security, empowering organizations to deploy self-managed AI agents that boost efficiency and strengthen defenses against evolving cyber threats. Kindo unifies SecOps, DevOps, and ITOps with secure, autonomous agents that understand intent, generate action, and execute at scale. It combines orchestration, policy, and automation in a single agentic system—giving teams full control across every operational layer. Kindo can run on-prem, in the cloud, or even across hybrid cloud and multi-cloud infrastructures. Self-Managed Kindo runs within your own environment, on a trusted machine that’s equipped with the appropriate certificates and credentials to access your systems.",
              "website": "https://www.kindo.ai",
              "logo": "kindo.png",
              "socials": [  
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/kindo-ai"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@kindoai"
                },
                {
                  "name": "X",
                  "url": "https://x.com/kindoai"
                },
                {
                  "name": "Instagram",
                  "url": "https://www.instagram.com/kindo.ai"
                }
              ] 
            }
          ]
        },
        {
          "name": "Gold",
          "sponsors": [
            {
              "name": "Altered Security",
              "description": "Start your Red Team training journey Altered Security! Altered Security offers multiple on-prem Red Team and Azure Red Team courses with affordable and enterprise-like hands-on labs. We are the creators of the popular Red Team certifications - CRTP, CRTE and CARTP. Join more than 40K professionals from 130+ countries.",
              "website": "https://www.alteredsecurity.com/",
              "logo": "altered.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/AlteredSecurity"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/alteredsecurity/"
                }
              ]
            },
            {
              "name": "HTX",
              "description": "As Singapore's science and technology agency for homeland security, HTX innovates and delivers cutting-edge technologies to force multiply the Home Team departments in their daily operations such as solving crimes, securing our borders, saving lives, safeguarding data and systems, and enhancing public safety and security, to accomplish our shared mission to keep Singapore safe and secure. To meet the Home Team’s unique requirements to operate in our complex environment, we take a holistic approach to provide end-to-end science and technology solutions to ensure that the Home Team's technologies and systems continuously perform at an optimal level while keeping pace with rapid changes.",
              "website": "https://www.htx.gov.sg",
              "logo": "htx4.png",
              "socials": [
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/htxsg/"
                }
              ]
            },
            { 
              "name": "SpecterOps",
              "description": "SpecterOps is the leader in Identity risk management. Possessing deep knowledge of adversary tradecraft, the company enables organizations to detect and remove critical attack paths – a practice called Identity Attack Path Management. BloodHound Enterprise is the company's managed SaaS for identity and security teams, allowing for attack path remediation guidance and reporting to show improvements over time. For more on SpecterOps, visit https://specterops.io.",
              "website": "https://specterops.io",
              "logo": "specterops.png",
              "socials": [
                {
                  "name": "LinkedIn",
                  "url": "http://linkedin.com/company/specterops"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@specterops"
                },
                {
                  "name": "X",
                  "url": "https://x.com/specterops"
                }
              ]
            }
          ]
        },
        {
          "name": "Silver",
          "sponsors": [
            {
              "name": "HAKAI",
              "description": "Hakai Security is a cybersecurity consulting firm operating within a comprehensive ecosystem focused on real-world offensive security. We deliver specialized services in Red Team operations, penetration testing, DevSecOps, and Attack Surface Management (ASM) - QuimeraX. Alongside our consulting services, we run an educational platform designed to advance offensive security education (Hacking Club), offering hands-on learning experiences that reflect real-world challenges faced by security professionals.",
              "website": "https://hakaisecurity.io/",
              "logo": "hakai-2.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/hakaioffsec"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/hakai-offensive-security/"
                },
                {
                  "name": "Instagram",
                  "url": "https://www.instagram.com/hakai_security"
                }
              ]
            },
            {
              "name": "Synack Red Team",
              "description": "The Synack Red Team is more than a bug bounty platform.  It represents a trusted global community of highly-skilled security researchers tasked with helping secure some of the world's most notable brands and government agencies.  Be curious, get paid for doing what you love, and find your hacker home!",
              "website": "https://synack.com/red-team",
              "logo": "synack.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/synackredteam"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/synack-red-team/"
                }
                
              ]
            },
            {
              "name": "Corelight",
              "description": "Corelight transforms network and cloud activity into evidence so that data-first defenders can stay ahead of ever-changing attacks. Delivered by our Open NDR Platform, Corelight’s comprehensive, correlated evidence gives you unparalleled visibility into your network. This evidence allows you to unlock new analytics, investigate faster, hunt like an expert, and even disrupt future attacks. Our on-prem and cloud sensors go anywhere to capture structured, industry-standard telemetry and insights that work with the tools and processes you already use. Corelight’s global customers include Fortune 500 companies, major government agencies, and research universities.",
              "website": "https://corelight.com/",
              "logo": "corelight.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/corelight_inc"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/corelight/"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/c/CorelightInc"
                }
              ]
            },
            {
              "name": "ThreatSims",
              "description": "The Synack Red Team is more than a bug bounty platform.  It represents a trusted global community of highly-skilled security researchers tasked with helping secure some of the world's most notable brands and government agencies.  Be curious, get paid for doing what you love, and find your hacker home!",
              "website": "https://threatsims.com/",
              "logo": "threatsims.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/threatsims"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/threatsims/"
                }
                
              ]
            }, 
            {
              "name": "HackingHub",
              "description": "Learn to hack, for the real world",
              "website": "https://hackinghub.io",
              "logo": "hackinghub.png",
              "socials": [
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@hackinghub_io"
                },
                {
                  "name": "X",
                  "url": "https://x.com/hackinghub_io"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/hackinghub-io"
                }
                
              ]
            }
          ]
        },
        {
          "name": "Bronze",
          "sponsors": [
            {
              "name": "Risk3Sixty",
              "description":"Risk3sixty empowers security and GRC leaders with elite consulting, a powerful GRC platform, and proven playbooks. The company is trusted by top organizations and recognized for innovation, execution, and a culture that attracts top industry talent.",
              "website": "https://www.risk3sixty.com/",
              "logo": "armada.png",
              "socials": [
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/risk3sixty"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@risk3sixty"
                }
              ]
            },
            {
              "name": "Bishop Fox",
              "description": "Bishop Fox is the leading authority in offensive security, providing solutions ranging from continuous penetration testing, red teaming, and attack surface management to product, cloud, and application security assessments. Discover why our Cosmos platform, service innovation, and culture of excellence draw industry awards, and our offerings are consistently ranked as “world class” by customers.",
              "website": "https://bishopfox.com/",
              "logo": "bishopfox2.png",
              "socials": [
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/bishop-fox/posts/?feedView=all/"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/c/Bishopfox"
                },
                {
                  "name": "X",
                  "url": "https://x.com/bishopfox"
                },
                {
                  "name": "Facebook",
                  "url": "https://www.facebook.com/BishopFoxConsulting"
                }
              ]
            }
          ]
        },
        {
          "name": "Red Team Village CTF",
          "sponsors": [
            {
              "name": "Optiv",
              "description": "Optiv is the cyber advisory and solutions leader, delivering strategic and technical expertise that allows you to secure your full potential. We advise, deploy and operate complete cybersecurity programs from strategy and managed security services to risk, integration and technology solutions.",
              "website": "https://www.optiv.com/",
              "logo": "optiv.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/Optiv"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/optiv-inc/"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@OptivInc"
                }
              ]
            }
          ]
        },
        {
          "name": "Cyber Wargames",
          "sponsors": []
        },
        {
          "name": "Prize",
          "sponsors": [
            {
              "name": "The SecOps Group",
              "description": "PentestingExams.com by The SecOps Group is a platform offering practical, scenario-based penetration testing exams across a wide range of domains—including web, mobile (Android & iOS), cloud, network, Active Directory, blockchain, and AI/ML. Each exam is designed to test real-world offensive security skills, helping professionals stay sharp and relevant in an evolving threat landscape. Our mission is to raise the bar for hands-on pentesting expertise and support the global security community through rigorous, accessible certifications.",
              "website": "https://pentestingexams.com/",
              "logo": "secopsgroup.png",
              "socials": [
                {
                  "name": "X",
                  "url": "https://x.com/@TheSecOpsGroup"
                },
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/secops-group/"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@TheSecOpsGroup"
                }
              ]
            },
            {
              "name": "Maltek Solutions",
              "description": "At Maltek Solutions, we are driven by an unwavering passion for cybersecurity. Our mission is to provide the best possible security solutions tailored to each customers unique needs. We believe in transparency, fairness, and equitable treatment for our team, which fosters an environment that enhances our ability to deliver top-notch services. \n\nBy collaborating closely with our customers at every step, we ensure solutions that not only meet their security requirements but also align with their budget constraints. Our holistic approach, engaging both executive decision-makers and frontline security teams, allows us to understand and address the diverse aspects of our customers’ security posture",
              "website": "https://malteksolutions.com",
              "logo": "malteksolutions.png",
              "socials": [
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/maltek-solutions-llc/"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@malteksolutions"
                }
              ]
            },
            {
              "name": "Just Hacking Training",
              "description": "Just Hacking Training is a platform providing \"Focused Technical Training for All Levels\" with 50+ affordable, hands-on options in 4 categories: Courses, Free Upskill Challenges, Hack-Alongs and CTFs. With new content released twice a month throughout 2025, bi-monthly livestreams with John Hammond and our All-Star contributors and even some \"Name Your Price\" options, JHT will advance your career regardless of experience level or budget.",
              "website": "https://www.justhacking.com",
              "logo": "justhacking.png",
              "socials": [
                {
                  "name": "LinkedIn",
                  "url": "https://www.linkedin.com/company/justhacking/"
                },
                {
                  "name": "X",
                  "url": "https://x.com/justhackinghq"
                },
                {
                  "name": "YouTube",
                  "url": "https://www.youtube.com/@justhackingtraining"
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
