{
  "updates": [
    {
      "title": "Call for Sponsors for DEF CON 33",
      "date": "March 10, 2025",
      "content": "We're officially accepting sponsors for our DEF CON 33 event! If you're interested in sponsoring the Red Team Village this year, please reach out to our team. We have various sponsorship tiers available from Bronze to Diamond, as well as specialized opportunities including CTF/Contest Sponsorships and Prize Contributions.\n\nOur team can share a sponsorship prospectus detailing all benefits and visibility opportunities for each level. We're also open to discussing custom sponsorship ideas that align with your organization's goals. Contact us soon to secure your spot, as premium sponsorship opportunities are limited and will fill quickly!",
      "tag": ["DEF CON 33", "Call for Sponsors"],
      "url": {
        "href": "mailto:sponsors@redteamvillage.io",
        "text": "Village Sponsorship Information"
      }
    },
    {
      "title": "Call for Volunteers for DEF CON 33",
      "date": "March 10, 2025",
      "content": "We're looking for volunteers for our DEF CON 33 event! If you're interested in volunteering with Red Team Village at DEF CON this year, please fill out the volunteer form linked below. We need volunteers to help with various aspects of our operation, including CTF support, workshop assistance, crowd control, general logistics, and much more.\n\n Volunteering offers a great opportunity to network with like-minded security professionals, gain behind-the-scenes experience at one of the world's premier hacking conferences, and contribute to the offensive security community. No matter your skill level, we have roles that can match your interests and expertise. All volunteers will receive special RTV volunteer swag and our sincere appreciation for helping make this year's village a success.",
      "tag": ["DEF CON 33", "Call for Volunteers"],
      "url": {
        "href": "https://forms.gle/LM9NWobjXYYxvHR78",
        "text": "Volunteer for the Village",
        "target": "_blank",
        "external": true
      }
    },
    {
      "title": "Call for Workshops & Tactics for DEF CON 33",
      "date": "March 10, 2025",
      "content": "We're looking for workshops and tactics for our DEF CON 33 event! If you're interested in hosting a workshop or sharing a tactic, please fill out the workshop form linked below.\n\nIdeal workshops provide structured, hands-on learning experiences led by an instructor. Meanwhile, tactics are short, self-guided activities that attendees can try out at their own pace in our less formal environment—perfect for demonstrating quick techniques, tool usage, or security concepts that can be completed in 10-20 minutes. These asynchronous activities allow participants to engage with practical offensive security skills in a drop-in format throughout the conference.\n\nWhether you're a seasoned professional with a comprehensive workshop or have a clever tactical exercise worth sharing, we encourage you to submit your proposal. Selected presenters will have the opportunity to share their expertise with hundreds of passionate security practitioners in our dedicated village space at DEF CON 33. Submit your workshop or tactics proposal soon, as selection will be competitive!",
      "tag": ["DEF CON 33", "Call for Workshops"],
      "url": {
        "href": "https://sessionize.com/rtv-at-defcon-33/",
        "text": "Submit a Workshop/Tactic",
        "target": "_blank",
        "external": true
      }
    },
    {
      "title": "RTV CRON Call for Workshops",
      "date": "March 10, 2025",
      "content": "We're looking for speakers for our RTV CRON workshop series! If you're interested in speaking, please fill out the Call on Sessionize. We're looking for a two hour workshop on a topic of your choice (as long as it's related to offensive security). For examples of what we're looking for, check out the RTV Overflow videos which we recently released on our YouTube channel.",
      "tag": ["RTV CRON", "Call for Workshops"],
      "image": {
        "src": "RTVcron-cfw.png",
        "alt": "Red Team Village Conference 2023"
      },
      "url": {
        "href": "https://sessionize.com/rtv-cron/",
        "text": "Answer the Call!",
        "external": true
      }
    },
    {
      "title": "And We're Back!",
      "date": "March 10, 2025",
      "content": "We are excited to announce that the new Red Team Village website is officially live!",
      "tag": ["Village News", "Website"]
    }
  ]
} 